In [1]:
import numpy as np
import pandas as pd 
import pandas_profiling

In [2]:
df_aisles = pd.read_csv("./data/aisles/aisles.csv")
df_departments = pd.read_csv("./data/departments/departments.csv")
df_order_products = pd.read_csv("./data/order_products/order_products.csv")
df_orders = pd.read_csv("./data/orders/orders.csv")
df_products = pd.read_csv("./data/products/products.csv")

In [17]:
df_orders

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0
...,...,...,...,...,...,...
3421078,2266710,206209,10,5,18,29.0
3421079,1854736,206209,11,4,10,30.0
3421080,626363,206209,12,1,12,18.0
3421081,2977660,206209,13,1,12,7.0
3421082,272231,206209,14,6,14,30.0

In [18]:
df_order_products

          order_id  product_id  add_to_cart_order
0                2       33120                  1
1                2       28985                  2
2                2        9327                  3
3                2       45918                  4
4                2       30035                  5
...            ...         ...                ...
33819101   3421063       14233                  3
33819102   3421063       35548                  4
33819103   3421070       35951                  1
33819104   3421070       16953                  2
33819105   3421070        4724                  3

[33819106 rows x 3 columns]

In [3]:
df1 = pd.merge(df_orders, df_order_products, on="order_id", how="inner")
df2 = pd.merge(df1, df_products, on="product_id")
df3 = pd.merge(df2, df_aisles, on="aisle_id")
df_all = pd.merge(df3, df_departments, on="department_id")
df_all

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,product_name,aisle_id,department_id,aisle,department
0,2539329,1,1,2,8,NaN,196,1,Soda,77,7,soft drinks,beverages
1,2398795,1,2,3,7,15.0,196,1,Soda,77,7,soft drinks,beverages
2,473747,1,3,3,12,21.0,196,1,Soda,77,7,soft drinks,beverages
3,2254736,1,4,4,7,29.0,196,1,Soda,77,7,soft drinks,beverages
4,431534,1,5,4,15,28.0,196,1,Soda,77,7,soft drinks,beverages
...,...,...,...,...,...,...,...,...,...,...,...,...,...
33819101,2939884,130327,3,1,13,0.0,27414,5,Organic Emmer Farro,68,10,bulk grains rice dried goods,bulk
33819102,3267360,150683,1,5,16,NaN,27414,13,Organic Emmer Farro,68,10,bulk grains rice dried goods,bulk
33819103,414077,159238,9,6,12,8.0,27414,1,Organic Emmer Farro,68,10,bulk grains rice dried goods,bulk
33819104,813243,171675,13,2,6,13.0,27414,34,Organic Emmer Farro,68,10,bulk grains rice dried goods,bulk
33819105,909758,176580,4,6,15,5.0,27414,15,Organic Emmer Farro,68,10,bulk grains rice dried goods,bulk

### Q1

In [51]:
df_all.groupby('user_id').product_id.nunique().max()

728

In [52]:
print(("There are " + str(df_all.groupby('user_id').product_id.nunique().max()) + " products that people usually order"))

There are 728 products that people usually order

### Q2

In [19]:
df_all['product_name'].mode()
print("Products banana are orderd the most")

Products banana are orderd the most

### Q3

In [57]:
df_test = df_all[['add_to_cart_order', 'product_name']]
df_test

          add_to_cart_order         product_name
0                         1                 Soda
1                         1                 Soda
2                         1                 Soda
3                         1                 Soda
4                         1                 Soda
...                     ...                  ...
33819101                  5  Organic Emmer Farro
33819102                 13  Organic Emmer Farro
33819103                  1  Organic Emmer Farro
33819104                 34  Organic Emmer Farro
33819105                 15  Organic Emmer Farro

[33819106 rows x 2 columns]

In [60]:
df_test[df_test['add_to_cart_order'] == 1].product_name.mode()

0    Banana
dtype: object

### Q4

In [67]:
df4 = df_all[['user_id', 'order_hour_of_day']]
df4

          user_id  order_hour_of_day
0               1                  8
1               1                  7
2               1                 12
3               1                  7
4               1                 15
...           ...                ...
33819101   130327                 13
33819102   150683                 16
33819103   159238                 12
33819104   171675                  6
33819105   176580                 15

[33819106 rows x 2 columns]

In [69]:
df4.groupby('user_id').order_hour_of_day.nunique()

user_id
1          7
2          5
3          6
4          3
5          4
          ..
206205     3
206206    10
206207    10
206208    16
206209     9
Name: order_hour_of_day, Length: 206209, dtype: int64

In [71]:
df4.groupby('user_id').order_hour_of_day.nunique().max()

24

In [72]:
print("People usually order products at 24 o'clock.")

People usually order products at 24 o'clock.